target/classes/test.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
        <ProcessTran xmlns="http://www.polaris.co.uk/XRTEService/2009/03/">
            <messageIn xmlns:a="http://schemas.datacontract.org/2004/07/XRTEService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <a:PanelID/>

<a:RequestXML>&lt;?xml version=&quot;1.0&quot;?&gt;
&lt;PolMessage Type=&quot;TransactionRequest&quot; Version=&quot;1&quot;&gt;
&lt;Dictionary DictName=&quot;UKHouse&quot; DictId=&quot;2&quot; DictVer=&quot;7500&quot; /&gt;
&lt;Transaction TranName=&quot;SpecialQuoteDetail&quot; EffectiveDate=&quot;07/08/2012&quot; /&gt;
&lt;Schemes&gt;
&lt;Scheme Ref=&quot;QGL7&quot; /&gt;
&lt;/Schemes&gt;
&lt;PolData Type=&quot;Request&quot; Selection=&quot;Specified&quot; ListDesc=&quot;Y&quot;&gt;
&lt;CalculatedResult&gt;
&lt;CalculatedResult_PolicyDesc /&gt;
&lt;CalculatedResult_PremiumExclIpt /&gt;
&lt;/CalculatedResult&gt;
&lt;BuildingsCover&gt;
&lt;BuildingsCover_AccidentalDamageGrantedInd /&gt;
&lt;BuildingsCover_Si /&gt;
&lt;BuildingsCalculatedResult&gt;
&lt;BuildingsCalculatedResult_PremiumExclIpt /&gt;
&lt;/BuildingsCalculatedResult&gt;
&lt;/BuildingsCover&gt;
&lt;ContentsCover&gt;
&lt;ContentsCover_AccidentalDamageGrantedInd /&gt;
&lt;ContentsCover_Si /&gt;
&lt;ContentsCalculatedResult&gt;
&lt;ContentsCalculatedResult_PremiumExclIpt /&gt;
&lt;/ContentsCalculatedResult&gt;
&lt;/ContentsCover&gt;
&lt;PedalCycleCover&gt;
&lt;PedalCycleCover_RiskCategory /&gt;
&lt;PedalCycleCover_Si /&gt;
&lt;PedalCycleCalculatedResult&gt;
&lt;PedalCycleCalculatedResult_PremiumExclIpt /&gt;
&lt;/PedalCycleCalculatedResult&gt;
&lt;/PedalCycleCover&gt;
&lt;AllRisksCover&gt;
&lt;AllRisksCalculatedResult&gt;
&lt;AllRisksCalculatedResult_PremiumExclIpt /&gt;
&lt;/AllRisksCalculatedResult&gt;
&lt;ArUnspecifiedItems&gt;
&lt;ArUnspecifiedItem_RiskCategory /&gt;
&lt;ArUnspecifiedItem_Si /&gt;
&lt;ArUnspecifiedItemCalculatedResult&gt;
&lt;ArUnspecifiedItemCalculatedResult_PremiumExclIpt /&gt;
&lt;/ArUnspecifiedItemCalculatedResult&gt;
&lt;/ArUnspecifiedItems&gt;
&lt;/AllRisksCover&gt;
&lt;DeclineResult&gt;
&lt;DeclineResult_Code /&gt;
&lt;DeclineResult_Text /&gt;
&lt;/DeclineResult&gt;
&lt;ReferResult&gt;
&lt;ReferResult_Code /&gt;
&lt;ReferResult_Text /&gt;
&lt;/ReferResult&gt;
&lt;EndorsementResult&gt;
&lt;EndorsementResult_Code /&gt;
&lt;/EndorsementResult&gt;
&lt;ExcessQuoteBreakdownResult&gt;
&lt;ExcessQuoteBreakdownResult_Amount /&gt;
&lt;ExcessQuoteBreakdownResult_Code /&gt;
&lt;ExcessQuoteBreakdownResult_Description /&gt;
&lt;ExcessQuoteBreakdownResult_PolicyLevelInd /&gt;
&lt;ExcessQuoteBreakdownResult_CoverCode /&gt;
&lt;ExcessQuoteBreakdownResult_XsType /&gt;
&lt;/ExcessQuoteBreakdownResult&gt;
&lt;/PolData&gt;
&lt;PolData Type=&quot;Input&quot;&gt;
&lt;Intermediary&gt;
&lt;Intermediary_CompanyId Val=&quot;S00080&quot; /&gt;
&lt;/Intermediary&gt;
&lt;Proposer&gt;
&lt;Proposer_Prn Val=&quot;1&quot; /&gt;
&lt;Proposer_DateOfBirth Val=&quot;16/07/1937&quot; /&gt;
&lt;Proposer_FirstTimeBuyerInd Val=&quot;N&quot; /&gt;
&lt;Proposer_DeclinedProposerInd Val=&quot;N&quot; /&gt;
&lt;Proposer_CancelledInd Val=&quot;N&quot; /&gt;
&lt;Proposer_RefusedInd Val=&quot;N&quot; /&gt;
&lt;Proposer_MaritalStatus Val=&quot;M&quot; /&gt;
&lt;Proposer_ConvictionInd Val=&quot;N&quot; /&gt;
&lt;Proposer_DeclaredBankruptInd Val=&quot;N&quot; /&gt;
&lt;Proposer_CcjsInd Val=&quot;N&quot; /&gt;
&lt;Proposer_ClientType Val=&quot;Private&quot; /&gt;
&lt;OtherInsurance&gt;
&lt;OtherInsurance_NoOfYearsHeld Val=&quot;4&quot; /&gt;
&lt;OtherInsurance_CurrentlyInsuredInd Val=&quot;Y&quot; /&gt;
&lt;/OtherInsurance&gt;
&lt;Occupation&gt;
&lt;Occupation_Code Val=&quot;A01&quot; /&gt;
&lt;/Occupation&gt;
&lt;/Proposer&gt;
&lt;Ncd&gt;
&lt;Ncd_ClaimedYears Val=&quot;2&quot; /&gt;
&lt;Ncd_CoverCode Val=&quot;02&quot; /&gt;
&lt;/Ncd&gt;
&lt;Ncd&gt;
&lt;Ncd_ClaimedYears Val=&quot;2&quot; /&gt;
&lt;Ncd_CoverCode Val=&quot;05&quot; /&gt;
&lt;/Ncd&gt;
&lt;Policy&gt;
&lt;Policy_InceptionStartDate Val=&quot;07/08/2012&quot; /&gt;
&lt;Policy_CurrentTermStartDate Val=&quot;07/08/2012&quot; /&gt;
&lt;Policy_EndDate Val=&quot;07/08/2013&quot; /&gt;
&lt;/Policy&gt;
&lt;Home&gt;
&lt;Home_SelfContainedInd Val=&quot;Y&quot; /&gt;
&lt;Home_OwnershipType Val=&quot;03&quot; /&gt;
&lt;Home_BusinessUseInd Val=&quot;N&quot; /&gt;
&lt;Home_RiskAddressPostCode Val=&quot;SS9 3AA&quot; /&gt;
&lt;Premises&gt;
&lt;Premises_LocksDiscountRequestedInd Val=&quot;Y&quot; /&gt;
&lt;Premises_NoBedrooms Val=&quot;3&quot; /&gt;
&lt;Premises_ConstructRoof Val=&quot;11&quot; /&gt;
&lt;Premises_ConstructWall Val=&quot;15&quot; /&gt;
&lt;Premises_FlatRoofInd Val=&quot;N&quot; /&gt;
&lt;Premises_ArchitecturalInterestCode Val=&quot;3&quot; /&gt;
&lt;Premises_GoodRepairInd Val=&quot;Y&quot; /&gt;
&lt;Premises_YearBuilt Val=&quot;1890&quot; /&gt;
&lt;Premises_SecurityAlarmInd Val=&quot;N&quot; /&gt;
&lt;Premises_TreesInVicinityInd Val=&quot;N&quot; /&gt;
&lt;Premises_PropertyType Val=&quot;09&quot; /&gt;
&lt;Premises_FreeFromFloodingInd Val=&quot;Y&quot; /&gt;
&lt;Premises_FreeFromGroundHeaveInd Val=&quot;Y&quot; /&gt;
&lt;Premises_FreeFromLandslipInd Val=&quot;Y&quot; /&gt;
&lt;Premises_FreeFromSubsidenceInd Val=&quot;Y&quot; /&gt;
&lt;Premises_UnderpinnedInd Val=&quot;N&quot; /&gt;
&lt;Premises_WidthOfCrack Val=&quot;0&quot; /&gt;
&lt;Premises_NearRiverWatercourseInd Val=&quot;Y&quot; /&gt;
&lt;Premises_WorkUndertakenInd Val=&quot;Y&quot; /&gt;
&lt;/Premises&gt;
&lt;Occupancy&gt;
&lt;Occupancy_SoleFamilyInd Val=&quot;Y&quot; /&gt;
&lt;Occupancy_Status Val=&quot;PH&quot; /&gt;
&lt;Occupancy_SmokerInd Val=&quot;N&quot; /&gt;
&lt;Occupancy_WhenOccupied Val=&quot;003&quot; /&gt;
&lt;/Occupancy&gt;
&lt;/Home&gt;
&lt;PostCode&gt;
&lt;PostCode_CodeSector Val=&quot;SS9 3&quot; /&gt;
&lt;PostCode_Type Val=&quot;03&quot; /&gt;
&lt;PostCode_CodeFull Val=&quot;SS9 3AA&quot; /&gt;
&lt;/PostCode&gt;
&lt;Loss&gt;
&lt;Loss_Type Val=&quot;01&quot; /&gt;
&lt;Loss_Cover Val=&quot;C13&quot; /&gt;
&lt;Loss_Date Val=&quot;01/2/2010&quot; /&gt;
&lt;Loss_ClaimStatus Val=&quot;003&quot; /&gt;
&lt;Loss_Amount Val=&quot;500&quot; /&gt;
&lt;Loss_Detail Val=&quot;Loss - detail&quot; /&gt;
&lt;/Loss&gt;
&lt;ProcessingIndicators&gt;
&lt;ProcessingIndicators_ProcessType Val=&quot;02&quot; /&gt;
&lt;/ProcessingIndicators&gt;
&lt;Security&gt;
&lt;Locks&gt;
&lt;Locks_FinalExitDoor Val=&quot;906&quot; /&gt;
&lt;Locks_ApprovedPatioSlidingDoorsInd Val=&quot;N&quot; /&gt;
&lt;Locks_ApprovedWindowsSkylightsInd Val=&quot;Y&quot; /&gt;
&lt;/Locks&gt;
&lt;/Security&gt;
&lt;Miscellaneous&gt;
&lt;Miscellaneous_TodaysDate Val=&quot;07/08/2012&quot; /&gt;
&lt;/Miscellaneous&gt;
&lt;BuildingsCover&gt;
&lt;BuildingsCover_RiskCategory Val=&quot;B05&quot; /&gt;
&lt;BuildingsCover_AmtReqd Val=&quot;500000&quot; /&gt;
&lt;BuildingsCover_AccidentalDamageReqdInd Val=&quot;N&quot; /&gt;
&lt;BuildingsCover_VolXsAmt Val=&quot;300&quot; /&gt;
&lt;/BuildingsCover&gt;
&lt;ContentsCover&gt;
&lt;ContentsCover_RiskCategory Val=&quot;C13&quot; /&gt;
&lt;ContentsCover_AmtReqd Val=&quot;55000&quot; /&gt;
&lt;ContentsCover_AccidentalDamageReqdInd Val=&quot;N&quot; /&gt;
&lt;ContentsCover_VolXsAmt Val=&quot;300&quot; /&gt;
&lt;UnspecifiedItems&gt;
&lt;UnspecifiedItems_AmtReqd Val=&quot;10000&quot; /&gt;
&lt;UnspecifiedItems_RiskCategory Val=&quot;P05&quot; /&gt;
&lt;UnspecifiedItems_Prn Val=&quot;1&quot; /&gt;
&lt;/UnspecifiedItems&gt;
&lt;/ContentsCover&gt;
&lt;AllRisksCover&gt;
&lt;ArSpecifiedItems&gt;
&lt;ArSpecifiedItems_RiskCategory Val=&quot;J011&quot; /&gt;
&lt;ArSpecifiedItems_AmtReqd Val=&quot;5000&quot; /&gt;
&lt;ArSpecifiedItems_Prn Val=&quot;1&quot; /&gt;
&lt;ArSpecifiedItems_CoverLocation Val=&quot;015&quot; /&gt;
&lt;/ArSpecifiedItems&gt;
&lt;ArUnspecifiedItems&gt;
&lt;ArUnspecifiedItems_AmtReqd Val=&quot;3000&quot; /&gt;
&lt;ArUnspecifiedItems_Prn Val=&quot;1&quot; /&gt;
&lt;ArUnspecifiedItems_RiskCategory Val=&quot;P05&quot; /&gt;
&lt;/ArUnspecifiedItems&gt;
&lt;/AllRisksCover&gt;
&lt;/PolData&gt;
&lt;/PolMessage&gt;</a:RequestXML>
                <a:SchemeListXML i:nil="true"/>
            </messageIn>
        </ProcessTran>
    </s:Body>
</s:Envelope>